void main () {
   List<int> array = [1, 2, 3, 4];
   redouble(array);
   print(array);
}

List<int> redouble(List<int> brr) {   
   for (int i=0; i< 4; i++){
      brr[i] = brr[i] * 2;
   }
   return brr;
} 


//#1
// на вход приходит массив целых чисел и функция
// нужно к каждому элементу массива применить функцию
// и вернуть в качестве результаты новый массив
// input: [1, 2, 3, 4], (e) => e*2
// output: [2, 4, 6, 8]


//#2
// на вход приходит массив целых чисел 
// вернуть массива положительных чисел и массив отрицательных
// как вернуть пару элементов?
// input: [1, -2, 3, -4]
// output: [1, 3], [-2, -4]



//#3
// на входе строка
// на выходе та же строка, но в обратном порядке
